---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.InvalidBoundaryError
source: html/41c40f7f-f3bd-1a4e-cbb2-d367f4be0421.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.InvalidBoundaryError Property

Failed to get a valid boundary.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidBoundaryError { get; }
```